# На вход программе поступают номера телефонов с привязкой к именам в виде строк следующего формата:
#
# номер_1 имя_1
# номер_2 имя_2
# ...
# номер_N имя_N
#
# В программе уже реализовано считывание всех строк и сохранение их в виде списка:
#
# lst_in = list(map(str.strip, sys.stdin.readlines()))
#
# На основе списка lst_in необходимо создать словарь d, где ключами будут имена, а значениями - список номеров
# телефонов для этого имени (ключа). Обратите внимание, что одному имени может принадлежать несколько разных номеров.
# Полученный словарь вывести командой:
#
# print(*sorted(d.items()))
#
# Тесты: https://github.com/selfedu-rus/test-python-base/tree/main/6/6.1.8
#
# Sample Input:
# +71234567890 Сергей
# +71234567810 Сергей
# +51234567890 Михаил
# +72134567890 Николай
# Sample Output:
# ('Михаил', ['+51234567890']) ('Николай', ['+72134567890']) ('Сергей', ['+71234567890', '+71234567810'])

#--------------------------------------------------------------------------------------
# s = '+71234567890 Сергей +71234567810 Сергей +51234567890 Михаил +72134567890 Николай'
#
# lst_in = list(s.split())
#
# lst_for_dict = [[lst_in[i+1], lst_in[i]] for i in range(0, len(lst_in), 2)]
#
# d = dict([
#     [lst_for_dict[i][0],
#     [lst_for_dict[j][1] for j in range(len(lst_for_dict)) if lst_for_dict[i][0] == lst_for_dict[j][0]]
#     ] for i in range(len(lst_for_dict))
# ])
#
# print(*sorted(d.items()))
#--------------------------------------------------------------------------------------

lst_in = ['+71234567890 Сергей', '+71234567810 Сергей', '+51234567890 Михаил', '+72134567890 Николай']

lst = [lst_in[i].split() for i in range(len(lst_in))]

d = dict([
     [lst[i][1],
     [lst[j][0] for j in range(len(lst)) if lst[i][1] == lst[j][1]]
     ] for i in range(len(lst))
 ])

print(*sorted(d.items()))

#--------------------------------------------------------------------------------------
# d = {}
#
# for i in lst_in:
#     value, key = i.split()
#     if key in d:
#         d[key] += [value]
#     else:
#         d[key] = [value]
#
# print(*sorted(d.items()))
#--------------------------------------------------------------------------------------
# d = {}
# for i in lst:
#     v, k = i.split()
#     d[k] = [v] if k not in d else d[k] + [v]
# print(*sorted(d.items()))