# На вход программе подается целое число: порядковый номер месяца (1, 2, ..., 12). Прочитайте это число (месяц) и
# выведите на экран количество дней в месяце, которому соответствует прочитанное число.
#
# При решении задачи принять, что год не является високосным. Программу реализовать через условный оператор, в
# котором следует использовать не более трех ветвей (блоков).
#
# P.S. Число дней в месяцах не високосного года, начиная с января: 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31
#
# Тесты: https://github.com/selfedu-rus/test-python-base/tree/main/4/4.2.5
#
# Sample Input:
# 2
# Sample Output:
# 28

month = int(input())

if month == 1 or month == 3 or month == 5 or month == 7 or month == 8 or month == 10 or month == 12:
    print(31)
elif month == 2:
    print(28)
else:
    print(30)