# На вход программе подается строка из русских букв и символов пробела. Необходимо ее прочитать и закодировать
# азбукой Морзе, где каждой букве ставится в соответствие код из точки и тире. После каждой закодированной буквы
# должен стоять пробел (символ окончания кода буквы). После последнего кода пробела быть не должно (в конце строки).
# Коды азбуки Морзе приведены ниже для русского алфавита и символа пробела:
# Результат кодирования вывести в виде строки.
#
# Словарь азбуки Морзе можно скачать по адресу: https://github.com/selfedu-rus/others (файл morze-dict.py).
#
# Тесты: https://github.com/selfedu-rus/test-python-base/tree/main/6/6.2.3
#
# Sample Input:
# Сергей Балакирев
# Sample Output:
# ... . .-. --. . .--- -...- -... .- .-.. .- -.- .. .-. . .--

s = input().lower()

morze = {'а': '.-', 'б': '-...', 'в': '.--', 'г': '--.', 'д': '-..', 'е': '.', 'ё': '.', 'ж': '...-', 'з': '--..',
         'и': '..', 'й': '.---', 'к': '-.-', 'л': '.-..', 'м': '--', 'н': '-.', 'о': '---', 'п': '.--.', 'р': '.-.',
         'с': '...', 'т': '-', 'у': '..-', 'ф': '..-.', 'х': '....', 'ц': '-.-.', 'ч': '---.', 'ш': '----',
         'щ': '--.-', 'ъ': '--.--', 'ы': '-.--', 'ь': '-..-', 'э': '..-..', 'ю': '..--', 'я': '.-.-', ' ': '-...-'}

s_result = ''

for x in s:
    s_result += morze.get(x) + ' '

print(s_result.rstrip())

# key = ['а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 'з',
#        'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р',
#        'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ',
#        'ъ', 'ы', 'ь', 'э', 'ю', 'я', ' ']
#
# val = ['.-', '-...', '.--', '--.', '-..', '.', '.', '...-', '--..',
#        '..', '.---', '-.-', '.-..', '--', '-.', '---', '.--.', '.-.',
#        '...', '-', '..-', '..-.', '....', '-.-.', '---.', '----', '--.-',
#        '--.--', '-.--', '-..-', '..-..', '..--', '.-.-', '-···-']
#
# morze = dict(zip(key, val))
# print(*[morze.get(i) for i in input().lower()])

# morze_dict = {'а': '.-', 'б': '-...', 'в': '.--', 'г': '--.', 'д': '-..', 'е': '.', 'ё': '.', 'ж': '...-',
# 'з': '--..', 'и': '..', 'й': '.---', 'к': '-.-', 'л': '.-..', 'м': '--', 'н': '-.', 'о': '---', 'п': '.--.',
# 'р': '.-.', 'с': '...', 'т': '-', 'у': '..-', 'ф': '..-.', 'х': '....', 'ц': '-.-.', 'ч': '---.', 'ш': '----',
# 'щ': '--.-', 'ъ': '--.--', 'ы': '-.--', 'ь': '-..-', 'э': '..-..', 'ю': '..--', 'я': '.-.-', ' ': '-...-'}
#
# for char in input():
#     print(morze_dict[char.lower()], end=' ')