# именами функций следует выбирать глаголы (например, go, set, get и т.п.)

# для вызова функции достаточно записать только ее имя - wrong

# именами функций следует выбирать существительные (например, name, message и т.п.) - wrong

# функция может быть вызвана в любом (допустимом) месте программы произвольное число раз

# оператор вызова функции - это ()

# имя функции - это ссылка на объект-функцию

# функция служит для устранения дублирования кода

# функция выполняет фрагмент программы, записанный в теле функции